{    
    "preview":{
            "text":"Hey ! This is Vincent Berthet",
            "typed":["I am an IT Digital Imaging engineer.", "Welcome on my website.", "Hope you will like it.","May we could meet one day :D."]
    }, 
    "navigation":{
         "bio":{
            "menu":"Bio",
            "title":"Who am I ?",
            "content":"<p>&nbsp;&nbsp;&nbsp;Hey ! My name is Vincent, I am a <span id='bio_age'></span> years old French student. I am currently studying IT Digital Imaging in the Ecole Supérieur d’Ingénieurs de Rennes (ESIR – Rennes 1), and I wish you the welcome on my Portfolio!</p><p> For <span id='bio_duration'></span> years, computing and electronic and media have taken a more and more part on my free time. First of all, I have started as a self-educated and I did many projects to discover deeper both fields to understand what I would like to do as a professional.</p><p>In this way I have decided to continue my further studies in a first time in Electrical Engineering and Industrial Computing for 2 years, in order to learn more about computing and to find out new field like automation and embedded computing which I have interest in.</p><p>Finally, after this degree I made the decision to study one year in a foreign country in a Game Development Bachelor’s Degree in Glasgow (University of the West of Scotland). This was an incredible human experience where I have discovered deeper a culture, met a lot of international people as well as features of computing. Moreover, it obviously helped improve my English, which is an omnipresent skill in my daily life.</p><p>The whole of these challenges and choices have significantly enhanced my personality, especially to understand better aspects of communication and to make my professional project.</p><p>Cheers</p>"
         },
         "portfolio":{
            "menu":"Portfolio",
            "title":"My Portfolio"
         },       
         "contact":{
            "menu":"Contact",
            "title":"Contact"
         }
     },
    "lang":"<img src='img/vberthet/uk_flag_16px.png' title='Click to switch to French' onclick='language.switch()'>",
    "portfolio":{
        "AsymetrieICP":{
            "title":"Asymetrie ICP",
            "description":"This project rely on “An algorithm to map asymmetries of bilateral objects in point clouds” - Benoît Combès & al.<br/>This algorithm able to automatically quantify the local asymmetries of bilateral structures in a point cloud by using Iterative Closest Point (ICP)"
        },
        "LunaAndHelios":{
            "title":"A Story of Luna & Helios",
            "description":"This game has been released during the Game Jam 2020.<br/>The aim of this event was to build a video game in 35 hours on the subject : “Safe in the dark”"
        },
        "Tensors":{
            "title":"Tensor directed stylization",
            "description":"This project rely on “Tensors-directed simulation of strokes for image stylization with hatching and contours” - David TSCHUMPERLE<br/>Its describe an algorithm to generate sketches from color images directed by an image-dependent tensor-valued geometry"
        },
        "HDR":{
            "title":"HDR",
            "description":"Experimentation of features related to High Dynamic Range (HDR) with OpenCV library"
        },
        "Askelys":{
            "title":"Askelys Report",
            "description":"Internship<br/>Report of my 4 months internship at <a href='http://askelys.com/' target='_blank'>Askelys</a> a startup working in the Semantic Web. Development of a WebGL prototype on Unity"
        },
        "Kubic":{
            "title":"Kubic Unity",
            "description":"Unity development project, aim of the project was to use navmesh"
        },
        "Ray":{
            "title":"Pathtracing",
            "description":"The aim of this project was to implement features of a Raytracing engine and optimisation structures related to it<br/>Then in a second part Global Illumination and Pathtracing have been added to this project."
        },
        "game_jam_2019":{
            "title":"Isati Game Jam 2019",
            "description":"Organization of the event"
        },
        "GOL":{
            "title":"Game of Life",
            "description":"GUI<br/> designed in order to understand ergonomic concerns of an application for different level of users" 
        },
        "website_v1":{
            "title":"Old website",
            "description":"Old release of this website (1.6)"
        },
        "TA":{
            "title":"Tower Attack",
            "description":"Advanced Mobile Programming<br/>Tower Attack Game, implementing advanced features like queues, stacks and pathways"
        },
        "orium":{
            "title":"Orium",
            "description":"3D Level Design<br/>A game based on the time that the player will make to finish the game"
        },
        "auld":{
            "title":"Auld",
            "description":"Game Design<br/>RTS game"
        },
        "scogue":{
            "title":"Scogue",
            "description":"Web game <br/>A Rogue like game"
        },
        "blog":{
            "title":"Blog",
            "description":"Creative Industries Blog<br/>A blog to deal with subject of the creative industries"
        },     
        "mutest":{
            "title":"Mu-Test Report",
            "description":"Internship<br/>Report of my 4 months internship at <a href='http://www.mu-test.com/' target='_blank'>Mu-Test</a>, a company working in the Automated Test Equipement (ATE)"
        },       
        "pacman":{
            "title":"Pac Man XNA",
            "description":"C# Project<br/>Development of the PacMan with the XNA framework"
        },      
        "monitoring":{
            "title":"Monitoring",
            "description":"UTD Project<br/>HMI to provide data of a batteries monitoring system to the user"
        }
    },
    "skills":{
        "programming":{
            "title":"Programming"
        },
        "web":{
            "title":"Web"
        },
        "database":{
            "title":"DataBase"
        },
        "shell":{
            "title":"Shell"
        },
        "software":{
            "title":"Software"
        },
        "other":{
            "title":"Other",
            "list":"Scrum"
        }       
    },
    "contact":{
        "info":{
                    "mail_button":{
                        "title":"Send me a mail"
                    },
                    "resume":{
                        "href":"request.html?type=Download&id=CV_EN",
                        "title":"Download my resume",
                        "text":"Resume"
                    },
                    "phone_button":{
                        "title":"Call me"
                    }
        },
        "social":{
                    "LKD":{
                        "title":"Let us connect"
                    },  
                    "TWI":{
                        "title":"Follow me"
                    },      
                    "YT":{
                        "title":"My channel"
                    },        
                    "INSTA":{
                        "title":"Discovers my photos"
                    },
                    "GITHUB":{
                        "title":"Discovers my projects"
                    }
                }
    },
  "footer":"Developed by"
}