{    
    "preview":{
            "text":"Hey ! Ici Vincent Berthet",
            "job":"<p><h3>< <span class='primary-color'>Actuellement en recherche d'emploi</span> ></h3></p>",
            "typed":["Je suis ingénieur en Imagerie Numérique.", "Bienvenue sur mon site.", "J'ose éspérer que tu l'apprécieras.","Peut-être nous nous rencontrerons un jour :D."]
    }, 
    "header":{
        "bio":{
            "anchor":"bio",
            "anchorText":"bio",
            "sectionTitle":"Qui suis-je ?"
        },
        "portfolio":{
            "anchor":"portfolio",
            "anchorText":"portfolio",
            "sectionTitle":"Mon Portfolio"
        },
        "contact":{
            "anchor":"contact",
            "anchorText":"contact",
            "sectionTitle":"Contact",
            "liclass":"margin-right-30"
        },
        "nightshift":{
            "onClick":"nightShift.toggle()",
            "anchorText":"<div id='nightShift' class='navicon'>nightshift</i></div>"
        },
        "flag":{
            "onClick":"language.switch()",
            "aclass":"flag",
            "anchorText":"<div class='navicon flag'><img src='img/template/france-flag-round-xs.png' title='Cliquer pour passer en anglais'></div>"
        }
    },
    "bio":{
        "right":{
            "text":"<p>&nbsp;&nbsp;&nbsp;&nbsp; Hey ! Je me présente Vincent, jeune diplômé français de <span id='bio_age'></span> ans. Je suis un ingénieur diplômé du cycle ingénieur Technologie de l'Information spécialité Imagerie Numérique au sein de l'Ecole Supérieur d’Ingénieurs de Rennes (ESIR - Rennes 1). Je vous souhaite la bienvenue sur mon portfolio !</p><p>Depuis plus de <span id='bio_duration'></span> ans, la programmation ainsi que l'univers du média et de l'électronique ont pris une place de plus en plus importante dans mon quotidien. En effet, depuis mes années lycéennes j'ai commencé petit à petit à mener divers projets, qui m'ont donné l'opportunité de découvrir l'informatique et de m’orienter vers le développement d’application logicielle.</p><p>Au cours de mon cursus scolaire, j'ai obtenu un DUT Génie Electrique et Informatique Industrielle qui m'a permis de découvrir l'électronique et l'informatique. A l’obtention de celui-ci, j’ai décidé de partir en mobilité internationale à l'University of the West of Scotland (UWS) de Glasgow pour apprendre la 3D à travers un Bsc Game Development. A la suite de quoi, j’ai intégré un cycle d’ingénieur où j’ai eu l’opportunité de suivre une formation unique en France car dédiée uniquement au vaste domaine de l’imagerie numérique.</p><p>J’ai pu mettre en pratique mes compétences lors de différents stages. En particulier au sein d’entreprises innovantes et à forte expertises, que ce soit une startup telle Askelys dans laquelle j’ai développé une interface 3D WebGL Unity pour leur API web sémantique. Ou bien, que ce soit lors de mon contrat de professionnalisation durant plus d’un an à l’Institut de Recherche Technologique b<>com, par ma contribution au développement d’un Framework de Réalité Augmentée open-source.</p><p>Tous ces challenges m’ont permis de m’enrichir personnellement et professionnellement. Vous pouvez retrouver ci-dessous quelques-uns de mes projets. N'hésitez pas à me contacter pour en savoir plus.</p><p>Cheers</p>"  }
    },
    "portfolio":{
        "Jekyll":{
            "title":"Jekyll",
            "abstract":"Création d'un site web avec Jekyll pour publier ( des fichiers markdown avec l'API de Github) et partager facilements des tips avec ma famille durant le confinement"
        },
        "ASCII_ART":{
            "title":"ASCII Art",
            "abstract":"Traite une image pour appliquer un effet <a href='https://fr.wikipedia.org/wiki/Art_ASCII'>ASCII Art</a>"
        },
        "Github_API":{
            "title":"Github API",
            "abstract":"Prise en main de l'API REST de Github afin d'automatiser la génération de mon portfolio avec mes répertoires publics de mon profile Github"
        },
        "BCOM":{
            "title":"b<>com contrat d'alternance",
            "abstract":"Contrat d'alternance (2019-2020)<br/>Rapport et slides de mes missions effectué durant mon alternance chez l'<a href='https://b-com.com/fr' target='_blank'>IRT b<>com</a>",
            "request":{
                "description":"<p>Rapport et présentation de mon contrat de professionalisation à <a target='_blank' href='https://b-com.com/'>b<>com</a></p><div>J'ai travaillé pendant un an en tant qu'ingénieur R&D au sein du laboratoire Immersive Medical Technologies spécialisé en vision par ordinateur et en vidéo. Au cours de cette année, j'ai contribué au développement d'un Framework C++17 open-source : <a href='https://solarframework.github.io/'>SolAR Framework</a>. Mes principaux travaux ont concerné le développement d'un plugin Unity pour Android, le support de l'intégration continu du framework, le développement des modules et d'un sample afin de pouvoir utiliser les caméras de profondeurs tel les <a href='https://www.intelrealsense.com/'>Intel RealSense</a>."
            }
        },
        "Asymetrie_ICP":{
            "title":"Asymétrie ICP",
            "abstract":"Ce projet repose sur le papier “An algorithm to map asymmetries of bilateral objects in point clouds” - Benoît Combès & al.<br/>Cet algorithme permet de quantifier automatiquement les asymétries d'une structure bilateral dans un nuage de point par ICP"
        },
        "Luna_And_Helios":{
            "title":"A Story of Luna & Helios",
            "abstract":"Jeu réalisé lors de la Game Jam 2020 d'Orange.<br/>L'objectif de cet évenement était de créer un jeu vidéo en 35 heures, sur le sujet : Safe in the dark",
            "request":{
                "description":"<p>Ce jeu a été réalisé lors de la game Jam 2020 d'Orange de l'ESIR. L'objectif de cet évenement était de réaliser un jeu vidéo en seulement 35 heures sur le theme : <b>Safe in the dark</b></p><p><b>Plus d'information sont disponible dans le README dédié du GitHub</b></p><p><a href='https://www.youtube.com/watch?v=EwTJOxKciyE&feature=youtu.be' target='_blank'><i class='fab fa-youtube'></i> Vidéo de gameplay</a></p>"
            }
        },
        "Tensors":{
            "title":"Stylisation dirigée par tenseurs",
            "abstract":"Ce project repose sur le papier \"Tensors-directed simulation of strokes for image stylization with hatching and contours\" - David TSCHUMPERLE de Septembre 2011 \n Cette publication décris un algorithme pour générer des dessins à partir d'image basé sur ses tenseurs géométriques"
        },
        "AR":{
            "title":"Réalité Augmentée",
            "abstract":"L'objectif de ce projet était de prendre plus en main le fonctionnement de la réalité augmentée ainsi que la librairie OpenCV. Notamment comment résoudre les problématiques liées à l'estimation de la pose"
        },
        "Crowd_Choice":{
            "title":"Crowd Choice",
            "abstract":"Formation d'une semaine en partenariat avec l'<a href='https://www.igr.univ-rennes1.fr/fr/' target='_blank'>IGR-IAE Rennes</a> dont l'objectif était de créer une startup avec toute les contraintes liées à l'entrepreneuriat",
            "request":{
                "description":"<div>Formation d'une semaine en partenariat avec l'<a href='https://www.igr.univ-rennes1.fr/fr/' target='_blank'>IGR-IAE Rennes</a> dont l'objectif était de créer une startup avec toute les contraintes liées à l'entrepreneuriat.</div><br/><div>Crowd Choice est une entreprise d’organisation événementielle basée sur un modèle de financement participatif. Le but est de produire des soirées à thème (style musical et culture étrangère) sur mesure, grâce à des sondages préparés en amont, dans les grandes villes de Bretagne. En fonction des votes de la communauté les évènements sont montés afin d'être soumis à un crowdfunding.</div>"
            }
        },
        "HDR":{
            "title":"HDR",
            "abstract":"Expérimentation de l'imagerie à grande gamme dynamique (HDR) avec la librairie OpenCV"
        },
        "Askelys":{
            "title":"Askelys Rapport",
            "abstract":"Rapport de stage au sein de l'entreprise <a href='http://askelys.com/' target='_blank'>Askelys</a> exerçant dans le domaine du web sémantique. Développement d'un prototype WebGL sous Unity",
            "request":{
                "description":"<p>Rapport de stage (4 mois)</p>Rapport de stage au sein de l'entreprise <a href='http://askelys.com/' target='_blank'>Askelys</a> exerçant dans le domaine du web sémantique. Développement d'un prototype WebGL sous Unity utilisant la librairie Javascript de l'entreprise dédié au web sémantique.</p>"      
            }
        },
        "Kubic":{
            "title":"Kubic Unity",
            "abstract":"Projet Unity, l'objectif de ce projet était d'utiliser le navmesh",
            "request":{
                "description":"<p><a href='https://docs.unity3d.com/ScriptReference/Application-streamingAssetsPath.html' target='_blank'>Streaming access ne sont pas utilisable avec Unity WebGL</a>.<br/>Ce jeu a été développé pour Windows, veuillez utiliser <a href='https://github.com/RealVincentBerthet/Kubic/blob/master/Kubic/Windows/Kubic.zip' target='_blank'>l'éxecutable Windows</a> pour avoir accès aux options, sons et autre fonctionalités</p><p>L'objectif de ce projet Unity était d'utiliser le navmesh.</br><b>Plus d'informations sont disponible dans le README dédié du GitHub </b></p>"
            }
        },
        "Ray":{
            "title":"Pathtracing",
            "abstract":"L'objectif de ce projet était d'implémenter les fonctionalités d'un moteur de lancé de rayons et des structures d'optimisation associés<br/>Dans un second temps, la gestion de l'illumination globale a été ajouté"

        },
        "Game_Jam_2k19":{
            "title":"Isati Game Jam 2019",
            "abstract":"Membre organisateur de l'évenement",
            "request":{
                "description":"<p>Trailer de la première <a href='https://esir.univ-rennes1.fr/actualites/la-1ere-game-jam-lesir' target='_blank' >Game Jam de l'ESIR</a> en partenariat avec <a href='https://www.orange-business.com/en' target='_blank'>Orange Applications for Business</a></p><p>Membre organisateur de l'évenement</p><p>Vainqueur : <a href='https://www.youtube.com/watch?v=E_g47fFlD-E'>Game Jam of Thrones</a></p><p>Trailer réalsé par Vincent Berthet</p>"
            }
        },
        "GOL":{
            "title":"Game of Life",
            "abstract":"Application visant à évaluer l'ergonomie d'un logiciel vis à vis d'utilisateurs de niveaux d'expertises différents" 
        },
        "WebsiteV1":{
            "title":"Ancien site",
            "abstract":"Ancienne version de ce site (1.6)" 
        },
        "TA":{
            "title":"Tower Attack",
            "abstract":"Programmation avancées pour support mobile"
        },
        "Orium":{
            "title":"Orium",
            "abstract":"Conception de niveaux 3D sous Unreal Engine 4",
            "request":{
                "description":"Conception de niveaux 3D sous Unreal Engine 4"
            }
        },
        "Auld":{
            "title":"Auld",
            "abstract":"RTS developpé sous Unreal Engine 4"
        },
        "Scogue":{
            "title":"Scogue",
            "abstract":"Jeu web développé avec le framework Phaser"
        },
        "Blog":{
            "title":"Blog",
            "abstract":"Blog WordPress Creative Industries"
        },     
        "Mutest":{
            "title":"Mu-Test Rapport",
            "abstract":"Rapport de stage au sein de l'entreprise <a href='http://www.mu-test.com/' target='_blank'>Mu-Test</a> exerçant dans le domaine de l'ATE (Automated Test Equipment). Développement de GUI (Java) au sein de la suite, test unitaire, bug fixing.",
            "request":{
                "description":"Rapport de stage"     
            }
        },       
        "Pacman":{
            "title":"Pac Man XNA",
            "abstract":"Développé avec le framework XNA",
            "request":{
                "description":"Présentation du jeu"     
            }
        },      
        "Monitoring":{
            "title":"Monitoring",
            "abstract":"Projet de DUT"
        }
    },
    "contact":{
        "mail":{
            "title":"Envoyer moi un mail"
        },
        "resume":{
            "title":"Télécharger mon CV",
            "text":"CV",
            "request":{
                "description":"Curriculum Vitae",
                "href":"CV/FR_CV_BERTHET_Vincent.pdf",
                "name":"FR_CV_BERTHET_Vincent.pdf"    
            }
        },
        "phone":{
            "title":"Appeler moi"
        }
    },
    "social":{
            "Linkedin":{
                "title":"On se connecte ?"
            },    
            "Twitter":{
                "title":"Follow me"
            },      
            "YouTube":{
                "title":"Ma chaîne"
            },        
            "Instagram":{
                "title":"Découvrer mes photos"
            },
            "Github":{
                "title":"Découvrer mes projets"
            }
        },
  "footer":{
      "dev":"Developpé par"
  },
  "templates":{
    "unknown":{
        "title":"Données manquante",
        "text":"La requête fournis ne peux pas être chargé correctement",
        "button":"Retour" 
    }, 
    "redirect":{
        "WIP":{
            "title":"Ce projet est en cours de développement",
            "text":"La version actuel risque de ne pas fonctionner comme voulu<br/>Merci de votre compréhension",
            "button":"Aller au projet" 
        },
        "Mobile":{
            "title":"Ce projet a été désigné pour les plateformes mobile",
            "text":"Si vous êtes sur un ordinateur utiliser l' ''inspecteur d'élément'",
            "button":"Aller au projet" 
        }
    },
    "counter":{
        "text":"Vous allez être automatiquement redirigé dans"
    }
}
}